Revit 2027 API
FamilySizeTableManager.RemoveSizeTable Method
 Removes the FamilySizeTable of a given name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RemoveSizeTable(
	string tableName
)
Public Function RemoveSizeTable (
	tableName As String
) As Boolean
public:
bool RemoveSizeTable(
	String^ tableName
)
member RemoveSizeTable :
        tableName : string -> bool
Parameters
tableName String
 The FamilySizeTable name.
Return Value
Boolean
 True if successful, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace